tests/Mock/CheckoutSessionAsyncPaymentFailed.txt

HTTP/1.1 200 OK
Server: nginx
Date: Tue, 7 Nov 2023 21:37:26 GMT
Content-Type: application/json
Cache-Control: no-cache, no-store

{
  "id": "evt_1O9rKU4Clds3ZoJoWxJdfs28",
  "object": "event",
  "api_version": "2014-03-28",
  "created": 1699371398,
  "data": {
    "object": {
      "id": "session_id_session_async_failed",
      "object": "checkout.session",
      "after_expiration": null,
      "allow_promotion_codes": null,
      "amount_subtotal": 3000,
      "amount_total": 3000,
      "automatic_tax": {
        "enabled": false,
        "status": null
      },
      "billing_address_collection": null,
      "cancel_url": "https://httpbin.org/post",
      "client_reference_id": null,
      "client_secret": null,
      "consent": null,
      "consent_collection": null,
      "created": 1699371382,
      "currency": "eur",
      "currency_conversion": null,
      "custom_fields": [
      ],
      "custom_text": {
        "shipping_address": null,
        "submit": null,
        "terms_of_service_acceptance": null
      },
      "customer": "cus_Oxmuig2rP5N6QC",
      "customer_creation": "always",
      "customer_details": {
        "address": {
          "city": "London",
          "country": "GB",
          "line1": "71 Crown Street",
          "line2": null,
          "postal_code": "W10 2WB",
          "state": null
        },
        "email": "stripe@example.com",
        "name": "Jenny Rosen",
        "phone": null,
        "tax_exempt": "none",
        "tax_ids": [
        ]
      },
      "customer_email": null,
      "expires_at": 1699457781,
      "invoice": null,
      "invoice_creation": {
        "enabled": false,
        "invoice_data": {
          "account_tax_ids": null,
          "custom_fields": null,
          "description": null,
          "footer": null,
          "metadata": {
          },
          "rendering_options": null
        }
      },
      "livemode": false,
      "locale": null,
      "metadata": {
      },
      "mode": "payment",
      "payment_intent": "payment_intent_id_session_async_failed",
      "payment_link": null,
      "payment_method_collection": "always",
      "payment_method_configuration_details": null,
      "payment_method_options": {
      },
      "payment_method_types": [
        "sepa_debit"
      ],
      "payment_status": "unpaid",
      "phone_number_collection": {
        "enabled": false
      },
      "recovered_from": null,
      "setup_intent": null,
      "shipping": null,
      "shipping_address_collection": null,
      "shipping_options": [
      ],
      "shipping_rate": null,
      "status": "complete",
      "submit_type": null,
      "subscription": null,
      "success_url": "https://httpbin.org/post",
      "total_details": {
        "amount_discount": 0,
        "amount_shipping": 0,
        "amount_tax": 0
      },
      "ui_mode": "hosted",
      "url": null
    }
  },
  "livemode": false,
  "pending_webhooks": 4,
  "request": null,
  "type": "checkout.session.async_payment_failed"
}